{
    "consultation": {
        "table": "consultation",
        "table_description": "The Consultation file (Consultation_NNN.txt) contains information relating to the type of consultation as entered by the GP (e.g. telephone, home visit, practice visit). Some consultations are linked to observations that occur during the consultation via the consultation identifier (consid).",
        "columns": {
            "consdate": {
                "description": "Description: Date associated with the event, Type: DATE, Format: DD/MM/YYYY, Field Name: Event date, Mapping: None",
                "name": "consdate"
            },
            "consid": {
                "description": "Description: Unique identifier given to the consultation. This is the primary key for this table., Type: TEXT, Format: Up to 19 numeric characters, Field Name: Consultation identifier, Mapping: None",
                "name": "consid",
                "is_primary_key": true
            },
            "consmedcodeid": {
                "description": "Description: Source of the consultation from EMIS® software. This is a medical code that can be used with the medical dictionary. It may contain information similar to the consultation source identifiers but is available for use now. Some of the codes may not be interpretable e.g. Awaiting clinical code migration to EMIS Web®., Type: TEXT, Format: 6-18 numeric characters, Field Name: Consultation source code identifier, Mapping: Medical dictionary. Maps to medcodeid",
                "name": "consmedcodeid"
            },
            "conssourceid": {
                "description": "Description: Identifier that allows retrieval of anonymised information on the source or location of the consultation as recorded in the EMIS® software. Only the most frequently occurring strings have been anonymised and are included in the lookup. All others have been withheld by CPRD, pending anonymisation where feasible., Type: TEXT, Format: Up to 10 numeric characters, Field Name: EMIS® consultation source identifier, Mapping: Lookup: ConsSource.txt",
                "name": "conssourceid"
            },
            "cprdconstype": {
                "description": "Description: Type of consultation: this will be generated by CPRD based on information recorded in the consmedcodeid and conssourceid variables. [Not currently populated], Type: INTEGER, Format: 3, Field Name: CPRD consultation source identifier, Mapping: Lookup: cprdconstype.txt [not included in initial release]",
                "name": "cprdconstype"
            },
            "enterdate": {
                "description": "Description: Date the event was entered into the practice system, Type: DATE, Format: DD/MM/YYYY, Field Name: Entered date, Mapping: None",
                "name": "enterdate"
            },
            "patid": {
                "description": "Description: Encrypted unique identifier given to a patient in CPRD Aurum. The patient identifier is unique to CPRD Aurum and may represent a different patient in the CPRD GOLD database., Type: TEXT, Format: 6-19 numeric characters, Field Name: Patient identifier, Mapping: Link Patient table",
                "name": "patid",
                "is_foreign_key": true
            },
            "pracid": {
                "description": "Description: Encrypted unique identifier given to a practice in CPRD Aurum, Type: INTEGER, Format: 5, Field Name: Practice identifier, Mapping: Link Practice table",
                "name": "pracid",
                "is_foreign_key": true
            },
            "staffid": {
                "description": "Description: Encrypted unique identifier given to the practice staff member who took the consultation in CPRD Aurum, Type: TEXT, Format: Up to 10 numeric characters, Field Name: Staff identifier, Mapping: Link Staff table",
                "name": "staffid",
                "is_foreign_key": true
            }
        }
    },
    "drugissue": {
        "table": "drugissue",
        "table_description": "The Drug issue file (DrugIssue_NNN.txt) contains details of all prescriptions on the GP system. This file contains data relating to all prescriptions (for drugs and appliances) issued by the GP. Some prescriptions are linked to problem-type observations via the Observation file, using the observation identifier (obsid).",
        "columns": {
            "dosageid": {
                "description": "Description: Identifier that allows dosage information on the event to be retrieved. Not included in first release, Type: TEXT, Format: 64 characters, Field Name: Dosage identifier, Mapping: Lookup: common_dosages.txt",
                "name": "dosageid"
            },
            "drugrecid": {
                "description": "Description: Unique identifier to a drug template record, which is not currently for release. At present this may be used to group repeat prescriptions from the same template., Type: TEXT, Format: Up to 19 numeric characters, Field Name: Drug record identifier, Mapping: None",
                "name": "drugrecid"
            },
            "duration": {
                "description": "Description: Duration of the treatment in days, Type: INTEGER, Format: 10, Field Name: Course duration in days, Mapping: None",
                "name": "duration"
            },
            "enterdate": {
                "description": "Description: Date the event was entered into EMIS Web®, Type: DATE, Format: DD/MM/YYYY, Field Name: Entered date, Mapping: None",
                "name": "enterdate"
            },
            "estnhscost": {
                "description": "Description: Estimated cost of the treatment to the NHS, Type: DECIMAL, Format: 10.4, Field Name: Estimated NHS cost, Mapping: None",
                "name": "estnhscost"
            },
            "issuedate": {
                "description": "Description: Date associated with the event, Type: DATE, Format: DD/MM/YYYY, Field Name: Event date, Mapping: None",
                "name": "issuedate"
            },
            "issueid": {
                "description": "Description: Unique identifier given to the issue record. This is the primary key for this table., Type: TEXT, Format: Up to 19 numeric characters, Field Name: Issue record identifier, Mapping: None",
                "name": "issueid",
                "is_primary_key": true
            },
            "patid": {
                "description": "Description: Encrypted unique identifier given to a patient in CPRD Aurum. The patient identifier is unique to CPRD Aurum and may represent a different patient in the CPRD GOLD database., Type: TEXT, Format: 6-19 numeric characters, Field Name: Patient identifier, Mapping: Link Patient table",
                "name": "patid",
                "is_foreign_key": true
            },
            "pracid": {
                "description": "Description: Encrypted unique identifier given to a practice in CPRD Aurum, Type: INTEGER, Format: 5, Field Name: Practice identifier, Mapping: Link Practice table",
                "name": "pracid",
                "is_foreign_key": true
            },
            "probobsid": {
                "description": "Description: Unique identifier for the observation that links to a problem under which this prescription was issued. This refers to an ‘obsid’ in the Observation table which, in turn, can be linked to a record in the Problem table using ‘obsid’., Type: TEXT, Format: Up to 19 numeric characters, Field Name: Problem observation identifier, Mapping: Link Observation and Problem tables",
                "name": "probobsid"
            },
            "prodcodeid": {
                "description": "Description: Unique CPRD code for the treatment selected by the GP, Type: TEXT, Format: 6-18 numeric characters, Field Name: Drug code identifier, Mapping: Lookup: Product dictionary",
                "name": "prodcodeid"
            },
            "quantity": {
                "description": "Description: Total quantity entered by the GP for the prescribed treatment, Type: DECIMAL, Format: 9.31, Field Name: Quantity, Mapping: None",
                "name": "quantity"
            },
            "quantunitid": {
                "description": "Description: Unit of the treatment (capsule, tablet), Type: INTEGER, Format: 2, Field Name: Quantity unit identifier, Mapping: Lookup: QuantUnit.txt",
                "name": "quantunitid"
            },
            "staffid": {
                "description": "Description: Encrypted unique identifier given to the practice staff member issued the treatment in CPRD Aurum, Type: TEXT, Format: Up to 10 numeric characters, Field Name: Staff identifier, Mapping: Link Staff table",
                "name": "staffid",
                "is_foreign_key": true
            }
        }
    },
    "observation": {
        "table": "observation",
        "table_description": "The Observation file (Observation_NNN.txt) contains medical history data entered on the GP system, including symptoms, clinical measurements, laboratory test results, diagnoses, and demographic information recorded as a clinical code (e.g. patient ethnicity). Observations that occur during a consultation can be linked via the consultation identifier. CPRD Aurum data are structured in a long format (multiple rows per subject), and observations can be linked to a parent observation.",
        "columns": {
            "consid": {
                "description": "Description: Linked consultation identifier. In EMIS Web® it is not necessary to enter observations within a consultation, so this identifier may be missing., Type: TEXT, Format: Up to 19 numeric characters, Field Name: Consultation identifier, Mapping: Link Consultation table",
                "name": "consid",
                "is_foreign_key": true
            },
            "enterdate": {
                "description": "Description: Date the event was entered into EMIS Web®, Type: DATE, Format: DD/MM/YYYY, Field Name: Entered date, Mapping: None",
                "name": "enterdate"
            },
            "medcodeid": {
                "description": "Description: CPRD unique code for the medical term selected by the GP, Type: TEXT, Format: 6-18 numeric characters, Field Name: Medical code, Mapping: Lookup: Medical dictionary",
                "name": "medcodeid"
            },
            "numrangehigh": {
                "description": "Description: Value representing the high boundary of the normal range for this measurement, Type: NUMERIC, Format: 19.3, Field Name: Numeric range high, Mapping: None",
                "name": "numrangehigh"
            },
            "numrangelow": {
                "description": "Description: Value representing the low boundary of the normal range for this measurement, Type: NUMERIC, Format: 19.3, Field Name: Numeric range low, Mapping: None",
                "name": "numrangelow"
            },
            "numunitid": {
                "description": "Description: Unit of measurement, Type: INTEGER, Format: 10, Field Name: Numeric unit identifier, Mapping: Lookup: NumUnit.txt",
                "name": "numunitid"
            },
            "obsdate": {
                "description": "Description: Date associated with the event, Type: DATE, Format: DD/MM/YYYY, Field Name: Event date, Mapping: None",
                "name": "obsdate"
            },
            "obsid": {
                "description": "Description: Unique identifier given to the observation. This is the primary key for this table., Type: TEXT, Format: Up to 19 numeric characters, Field Name: Observation identifier, Mapping: None",
                "name": "obsid",
                "is_primary_key": true
            },
            "obstypeid": {
                "description": "Description: Type of observation (allergy, family history, observation), Type: INTEGER, Format: 5, Field Name: Observation type identifier, Mapping: Lookup: ObsType.txt",
                "name": "obstypeid"
            },
            "parentobsid": {
                "description": "Description: Observation identifier (obsid) that is the parent to the observation. This enables grouping of multiple observations, such as systolic and diastolic blood pressure, or blood test results., Type: TEXT, Format: Up to 19 numeric characters, Field Name: Parent observation identifier, Mapping: Link Observation table",
                "name": "parentobsid"
            },
            "patid": {
                "description": "Description: Encrypted unique identifier given to a patient in CPRD Aurum. The patient identifier is unique to CPRD Aurum and may represent a different patient in the CPRD GOLD database., Type: TEXT, Format: 6-19 numeric characters, Field Name: Patient identifier, Mapping: Link Patient table",
                "name": "patid",
                "is_foreign_key": true
            },
            "pracid": {
                "description": "Description: Encrypted unique identifier given to a practice in CPRD Aurum, Type: INTEGER, Format: 5, Field Name: Practice identifier, Mapping: Link Practice table",
                "name": "pracid",
                "is_foreign_key": true
            },
            "probobsid": {
                "description": "Description: Observation identifier (obsid) of any problem that an observation is associated with. An example of this might be an overarching condition that the current observation is associated with such as ‘wheezing’ with the problem observation identifier that links to an observation of ‘asthma’, that in turn contains information in the\nproblem table., Type: TEXT, Format: Up to 19 numeric characters, Field Name: Problem observation identifier, Mapping: Link Observation table",
                "name": "probobsid"
            },
            "staffid": {
                "description": "Description: Encrypted unique identifier given to the practice staff member who took the consultation in CPRD Aurum, Type: TEXT, Format: Up to 10 numeric characters, Field Name: Staff identifier, Mapping: Link Staff table",
                "name": "staffid",
                "is_foreign_key": true
            },
            "value": {
                "description": "Description: Measurement or test value, Type: NUMERIC, Format: 19.3, Field Name: Value, Mapping: None",
                "name": "value"
            }
        }
    },
    "patient": {
        "table": "patient",
        "table_description": "The Patient file (Patient_NNN.txt) contains basic patient demographics and patient registration details for the patients.",
        "columns": {
            "acceptable": {
                "description": "Description: Flag to indicate whether the patient has met certain quality standards: 1 =acceptable, 0 = unacceptable, Type: INTEGER, Format: 1, Field Name: Acceptable flag, Mapping: None",
                "name": "acceptable"
            },
            "cprd_ddate": {
                "description": "Description: Estimated date of death of patient – derived using a CPRD algorithm, Type: DATE, Format: DD/MM/YYYY, Field Name: CPRD death date, Mapping: None",
                "name": "cprd_ddate"
            },
            "emis_ddate": {
                "description": "Description: Date of death as recorded in the EMIS® software. Researchers are advised to treat the emis_ddate with caution and consider using the cprd_ddate variable below., Type: DATE, Format: DD/MM/YYYY, Field Name: Date of death, Mapping: None",
                "name": "emis_ddate"
            },
            "gender": {
                "description": "Description: Patient’s gender, Type: INTEGER, Format: 3, Field Name: Gender, Mapping: Lookup: Gender.txt",
                "name": "gender"
            },
            "mob": {
                "description": "Description: Patient’s month of birth (for those aged under 16)., Type: INTEGER, Format: 2, Field Name: Month of birth, Mapping: None",
                "name": "mob"
            },
            "patid": {
                "description": "Description: Encrypted unique identifier given to a patient in CPRD Aurum. The patient identifier is unique to CPRD Aurum and may represent a different patient in the CPRD GOLD database. This is the primary key for this table. The last 5 characters will be same as the CPRD practice identifier, Type: TEXT, Format: 6-19 numeric characters, Field Name: Patient identifier, Mapping: None",
                "name": "patid",
                "is_primary_key": true
            },
            "patienttypeid": {
                "description": "Description: The category that the patient has been assigned to e.g. private, regular, temporary., Type: INTEGER, Format: 5, Field Name: Patient type, Mapping: Lookup: PatientType.txt",
                "name": "patienttypeid"
            },
            "pracid": {
                "description": "Description: Encrypted unique identifier given to a practice in CPRD Aurum, Type: INTEGER, Format: 5, Field Name: CPRD practice identifier, Mapping: Link Practice table",
                "name": "pracid",
                "is_foreign_key": true
            },
            "regenddate": {
                "description": "Description: Date the patient's registration at the practice ended. This may represent a transfer-out date or death date., Type: DATE, Format: DD/MM/YYYY, Field Name: Registration end date, Mapping: None",
                "name": "regenddate"
            },
            "regstartdate": {
                "description": "Description: The date that the patient registered with the CPRD contributing practice. Most recent date the patient is recorded as having registered at the practice. If a patient deregistered for a period of time and returned, the return date would be recorded., Type: DATE, Format: DD/MM/YYYY, Field Name: Registration start date, Mapping: None",
                "name": "regstartdate"
            },
            "usualgpstaffid": {
                "description": "Description: The GP that the patient is nominally registered with. To be used with the Staff table for reference, Type: TEXT, Format: Up to 10 numeric characters, Field Name: Usual GP, Mapping: Link Staff table",
                "name": "usualgpstaffid"
            },
            "yob": {
                "description": "Description: Patient’s year of birth. This is actual year of birth e.g. 1984., Type: INTEGER, Format: 4, Field Name: Year of birth, Mapping: None",
                "name": "yob"
            }
        }
    },
    "practice": {
        "table": "practice",
        "table_description": "The Practice file (Practice_NNN.txt) contains details of each practice, including the practice identifier, practice region, and the last collection date.",
        "columns": {
            "lcd": {
                "description": "Description: Date of the most recent CPRD data collection for the practice., Type: DATE, Format: DD/MM/YYYY, Field Name: Last Collection Date, Mapping: None",
                "name": "lcd"
            },
            "pracid": {
                "description": "Description: Encrypted unique identifier given to a practice in CPRD Aurum. This is the primary key for this table., Type: INTEGER, Format: 5, Field Name: Practice identifier, Mapping: None",
                "name": "pracid",
                "is_primary_key": true
            },
            "region": {
                "description": "Description: Value to indicate where in the UK the practice is based. The region denotes the Strategic Health Authority (for builds to Dec 2021) or ONS region (for builds from Jan 2022) for English practices., Type: INTEGER, Format: 5, Field Name: Region, Mapping: Lookup: Region.txt",
                "name": "region"
            },
            "uts": {
                "description": "Description: The date at which the practice data is deemed to be of research quality, based on CPRD algorithm. [Not currently populated], Type: DATE, Format: DD/MM/YYYY, Field Name: Up-to-standard date, Mapping: None",
                "name": "uts"
            }
        }
    },
    "problem": {
        "table": "problem",
        "table_description": "b. The Problem file (Problem_NNN.txt) contains details of the patient’s medical history that have been defined by the GP as a ‘problem’. Data in the problem file are linked to the observation file and contain ‘add-on’ data for problem-type observations. Information on identifying associated problems, the significance of the problem, and its expected duration can be found in this table. GPs may use ‘problems’ to manage chronic conditions as it would allow them to group clinical events (including drug prescriptions, measurements, symptom recording) by problem rather than chronologically. To obtain the full problem record (including the clinical code for the problem), problems should be linked to the Observation file using the observation identifier (obsid).",
        "columns": {
            "expduration": {
                "description": "Description: Expected duration of the problem in days, Type: INTEGER, Format: 5, Field Name: Expected duration, Mapping: None",
                "name": "expduration"
            },
            "lastrevdate": {
                "description": "Description: Date the problem was last reviewed, Type: DATE, Format: DD/MM/YYYY, Field Name: Last review date, Mapping: None",
                "name": "lastrevdate"
            },
            "lastrevstaffid": {
                "description": "Description: Staff member who last reviewed the problem, Type: TEXT, Format: Up to 10 numeric characters, Field Name: Last review staff identifier, Mapping: Link Staff table",
                "name": "lastrevstaffid"
            },
            "obsid": {
                "description": "Description: Unique identifier given to the observation. This is the primary key for this table., Type: TEXT, Format: Up to 19 numeric characters, Field Name: Observation identifier, Mapping: Link Observation table",
                "name": "obsid",
                "is_foreign_key": true
            },
            "parentprobobsid": {
                "description": "Description: Observation identifier for the parent observation of the problem. This can be used to group problems via the Observation table., Type: TEXT, Format: Up to 19 numeric characters, Field Name: Parent problem observation identifier, Mapping: Link Observation table",
                "name": "parentprobobsid"
            },
            "parentprobrelid": {
                "description": "Description: Description of the relationship of the problem to another problem e.g. the problem may have evolved or been merged with another problem as the problem, or the GP’s understanding of the problem, changes, Type: INTEGER, Format: 5, Field Name: Parent problem relationship identifier, Mapping: Lookup ParentProbRel.txt",
                "name": "parentprobrelid"
            },
            "patid": {
                "description": "Description: Encrypted unique identifier given to a patient in CPRD Aurum. The patient identifier is unique to CPRD Aurum and may represent a different patient in the CPRD GOLD database., Type: TEXT, Format: 6-19 numeric characters, Field Name: Patient identifier, Mapping: Link Patient table",
                "name": "patid",
                "is_foreign_key": true
            },
            "pracid": {
                "description": "Description: Encrypted unique identifier given to a practice in CPRD Aurum, Type: INTEGER, Format: 5, Field Name: Practice identifier, Mapping: Link Practice table",
                "name": "pracid",
                "is_foreign_key": true
            },
            "probenddate": {
                "description": "Description: Date the problem ended, Type: DATE, Format: DD/MM/YYYY, Field Name: Problem end date, Mapping: None",
                "name": "probenddate"
            },
            "probstatusid": {
                "description": "Description: Status of the problem (active, past), Type: INTEGER, Format: 5, Field Name: Problem status identifier, Mapping: Lookup: ProbStatus.txt",
                "name": "probstatusid"
            },
            "signid": {
                "description": "Description: Significance of the problem (minor, significant), Type: INTEGER, Format: 5, Field Name: Significance, Mapping: Lookup: Sign.txt",
                "name": "signid"
            }
        }
    },
    "referral": {
        "table": "referral",
        "table_description": "a. The Referral file (Referral_NNN.txt) contains referral details recorded on the GP system. Data in the referral file are linked to the observation file and contain ‘add-on’ data for referral-type observations. These files contain information involving both inbound and outbound patient referrals to or from external care centres (normally to secondary care locations such as hospitals for inpatient or outpatient care). To obtain the full referral record (including reason for the referral and date), referrals should be linked to the Observation file using the observation identifier (obsid).",
        "columns": {
            "obsid": {
                "description": "Description: Unique identifier given to the observation. This is the primary key for this table., Type: TEXT, Format: Up to 19 numeric characters, Field Name: Observation identifier, Mapping: Link Observation table",
                "name": "obsid",
                "is_foreign_key": true
            },
            "patid": {
                "description": "Description: Encrypted unique identifier given to a patient in CPRD Aurum. The patient identifier is unique to CPRD Aurum and may represent a different patient in the CPRD GOLD database., Type: TEXT, Format: 6-19 numeric characters, Field Name: Patient identifier, Mapping: Link Patient table",
                "name": "patid",
                "is_foreign_key": true
            },
            "pracid": {
                "description": "Description: Encrypted unique identifier given to a practice in CPRD Aurum, Type: INTEGER, Format: 5, Field Name: Practice identifier, Mapping: Link Practice table",
                "name": "pracid",
                "is_foreign_key": true
            },
            "refmodeid": {
                "description": "Description: Mode by which the referral was made e.g. telephone, written, Type: INTEGER, Format: 1, Field Name: Referral mode identifier, Mapping: Lookup: RefMode.txt",
                "name": "refmodeid"
            },
            "refservicetypeid": {
                "description": "Description: Type of service the referral relates to e.g. assessment, management, investigation, Type: INTEGER, Format: 2, Field Name: Referral service type identifier, Mapping: Lookup: RefServiceType.txt",
                "name": "refservicetypeid"
            },
            "refsourceorgid": {
                "description": "Description: Source organisation of the referral. Organisations are identified by an ID number and each organisation has a type (e.g. hospital inpatient department, community clinic). Both the organisation table and the OrgType lookup are required. The lookups are undergoing anonymisation work. [Not currently populated], Type: INTEGER, Format: 10, Field Name: Referral source organisation identifier, Mapping: Lookups: Organisation.txt [not included in initial release] and OrgType.txt",
                "name": "refsourceorgid"
            },
            "reftargetorgid": {
                "description": "Description: Source organisation of the referral. Organisations are identified by an ID number and each organisation has a type (e.g. hospital inpatient department, community clinic). Both the organisation table and the OrgType lookup are required. The lookups are undergoing anonymisation work. [Not currently populated], Type: INTEGER, Format: 10, Field Name: Referral target organisation identifier, Mapping: Lookups: Organisation.txt [not included in initial release] and OrgType.txt",
                "name": "reftargetorgid"
            },
            "refurgencyid": {
                "description": "Description: Urgency of the referral e.g. routine, urgent, dated, Type: INTEGER, Format: 1, Field Name: Referral urgency identifier, Mapping: Lookup: RefUrgency.txt",
                "name": "refurgencyid"
            }
        }
    },
    "staff": {
        "table": "staff",
        "table_description": "The Staff file (Staff_NNN.txt) contains practice staff details for each staff member, including job category.",
        "columns": {
            "jobcatid": {
                "description": "Description: Job category of the staff member who created the event, Type: INTEGER, Format: 5, Field Name: Job category, Mapping: Lookup JobCat.txt",
                "name": "jobcatid"
            },
            "pracid": {
                "description": "Description: Encrypted unique identifier given to a practice in CPRD Aurum, Type: INTEGER, Format: 5, Field Name: Practice identifier, Mapping: Link Practice table",
                "name": "pracid",
                "is_foreign_key": true
            },
            "staffid": {
                "description": "Description: Encrypted unique identifier given to the practice staff member in CPRD Aurum. This is the primary key for this table., Type: TEXT, Format: Up to 10 numeric characters, Field Name: Staff identifier, Mapping: None",
                "name": "staffid",
                "is_primary_key": true
            }
        }
    }
}